/* <============== CREDITS ==============>
Author: @berkahesport.id
Contact me: 62895375950107

Do not delete the source.
Thanks you...
*/
export default {
        settings: {
            prefix: ".",
            restapi: "https://berkahesport.my.id/api/",
            apikey: "your-apikey", // Get it from https://berkahesport.my.id/
            groqkey: "", // Contact me for the API key https:/wa.me/62895375950107 or source code https://console.groq.com/keys
            mongodb: "", // MongoDB connection string https://cloud.mongodb.com/
            store: false, // using store
            case: false // if true using case not plugin
        },
        name: {
            bot: "ʙᴇʀᴋᴀʜᴇꜱᴘᴏʀᴛ.ɪᴅ",
            owner: "@berkahesport.id"
        },
        number: {
            bot: "", // If you want
            mods: ["62895375950107"],
            owner: "62895375950107"
        },
        group: {
            ofc: "https://chat.whatsapp.com/JKdIWr5fj990Ux2oqTjTo5",
            chid: "120363312128345279@newsletter"
        },
        text: {
            create: "² October 2021",
            wait: "```「▰▰▰▰▱▱▱▱▱▱」Loading...```",
            waits: [
                "```「▰▱▱▱▱▱▱▱▱▱」Loading...```",
                "```「▰▰▱▱▱▱▱▱▱▱」Loading...```",
                "```「▰▰▰▱▱▱▱▱▱▱」Loading...```",
                "```「▰▰▰▰▱▱▱▱▱▱」Loading...```",
                "```「▰▰▰▰▰▱▱▱▱▱」Loading...```"
            ],
            error: "( ⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀) *𝔼ℝℝ𝕆ℝ* ( ⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)\n\n• The feature encountered an error. Please report it to the owner!\n> *Chat the owner*: _https://wa.me/62895375950107_ \n> _Or try the command again after a while!_",
            ty: "\n> 💭 ʜᴇʀᴇ ɪꜱ ᴛʜᴇ ʀᴇꜱᴜʟᴛ... \n> ᴅᴏɴ'ᴛ ꜰᴏʀɢᴇᴛ ᴛᴏ ꜱᴜᴘᴘᴏʀᴛ ɪɢ @ʙᴇʀᴋᴀʜᴇꜱᴘᴏʀᴛ.ɪᴅ! \n> 👍 ᴛʜᴀɴᴋ ʏᴏᴜ!",
            subs: "Don't just look, make sure to subscribe too! \n https://m.youtube.com/channel/UCG_Xj6eHBMaW9HTHTya9q6w"
        },
        msg: {
            rowner: "*𝕂ℍ𝕌𝕊𝕌𝕊 𝔻𝔼𝕍𝔼𝕃𝕆ℙ𝔼ℝ* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ᴜɴᴛᴜᴋ ᴅᴇᴠᴇʟᴏᴘᴇʀ ʙᴏᴛ",
            owner: "*𝕂ℍ𝕌𝕊𝕌𝕊 𝕆𝕎ℕ𝔼ℝ* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ᴜɴᴛᴜᴋ ᴏᴡɴᴇʀ ʙᴏᴛ",
            premium: "*𝕂ℍ𝕌𝕊𝕌𝕊 ℙℝ𝔼𝕄𝕀𝕌𝕄* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ᴜɴᴛᴜᴋ ᴘʀᴇᴍɪᴜᴍ ᴜsᴇʀ",
            group: "*𝕂ℍ𝕌𝕊𝕌𝕊 𝔾ℝ𝕆𝕌ℙ* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ʙɪsᴀ ᴅɪᴘᴀᴋᴀɪ ᴅɪᴅᴀʟᴀᴍ ɢʀᴏᴜᴘ",
            private: "*𝕂ℍ𝕌𝕊𝕌𝕊 ℂℍ𝔸𝕋 ℙℝ𝕀𝔹𝔸𝔻𝕀* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ʙɪsᴀ ᴅɪᴘᴀᴋᴀɪ ᴅɪᴘʀɪᴠᴀᴛᴇ ᴄʜᴀᴛ",
            admin: "*𝕂ℍ𝕌𝕊𝕌𝕊 𝔸𝔻𝕄𝕀ℕ* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ᴜɴᴛᴜᴋ ᴀᴅᴍɪɴ ɢʀᴏᴜᴘ",
            botAdmin: "*𝕂ℍ𝕌𝕊𝕌𝕊 𝔹𝕆𝕋 𝔸𝔻𝕄𝕀ℕ* • ᴄᴏᴍᴍᴀɴᴅ ɪɴɪ ʜᴀɴʏᴀ ʙɪsᴀ ᴅɪɢᴜɴᴀᴋᴀɴ ᴋᴇᴛɪᴋᴀ ʙᴏᴛ ᴍᴇɴᴊᴀᴅɪ ᴀᴅᴍɪɴ",
            restrict: "*𝕄𝔼ℕ𝕌 𝔸𝔻𝕄𝕀ℕ* • ʀᴇsᴛʀɪᴄᴛ ʙᴇʟᴜᴍ ᴅɪɴʏᴀʟᴀᴋᴀɴ ᴅɪᴄʜᴀᴛ ɪɴɪ",
            nsfw: "*ℙ𝔸ℝ𝔸ℍ 𝕃𝕌!!!* • ɴᴀᴋ ᴋᴀᴍᴜ ʙᴇʟᴜᴍ ᴄᴜᴋᴜᴘ ᴜᴍᴜʀ. ᴊᴀɴɢᴀɴ ᴍᴀᴋꜱᴀ!!!",
            ramadhan: "*(人◕‿◕) ℝ𝕒𝕞𝕒𝕕𝕙𝕒𝕟 𝔹𝕦𝕝𝕒𝕟 𝕊𝕦𝕔𝕚 (•◡•)* • ᴍᴏʜᴏɴ ᴍᴀᴀꜰ ꜱᴇʟᴀᴍᴀ ʙᴜʟᴀɴ ꜱᴜᴄɪ ʀᴀᴍᴀᴅʜᴀɴ ꜰɪᴛᴜʀ ɪɴɪ ᴅɪ ᴍᴀᴛɪᴋᴀɴ. ᴛᴇʀɪᴍᴀ ᴋᴀꜱɪʜ!",
            text: "*𝕋𝔼𝕂𝕊 𝕃𝕀𝕄𝕀𝕋𝔼𝔻* • ᴛᴇᴋꜱ ʏᴀɴɢ ᴋᴀᴍᴜ ᴍᴀꜱᴜᴋᴋᴀɴ ᴛᴇʀʟᴀʟᴜ ʙᴀɴʏᴀᴋ! ᴍᴀᴋꜱ. 1500 ᴋᴀʀᴀᴋᴛᴇʀ. ",
            unreg: "ʜᴀʟʟᴏ ᴋᴀᴋ ! 👋\nᴀɴᴅᴀ ʜᴀʀᴜs ᴍᴇɴᴅᴀғᴛᴀʀ ᴋᴇ ᴅᴀᴛᴀʙᴀsᴇ ʙᴏᴛ ᴅᴜʟᴜ sᴇʙᴇʟᴜᴍ ᴍᴇɴɢɢᴜɴᴀᴋᴀɴ ғɪᴛᴜʀ ɪɴɪ\n\nᴋᴇᴛɪᴋ .daftar ɴᴀᴍᴀ.ᴜᴍᴜʀ \nᴄᴏɴᴛᴏʜ .daftar BerkahEsport.26",//➞ ᴋʟɪᴄᴋ ᴛᴏᴍʙᴏʟ ᴅɪʙᴀᴡᴀʜ ᴜɴᴛᴜᴋ ᴍᴇɴᴅᴀғᴛᴀʀ ᴋᴇ ᴅᴀᴛᴀʙᴀsᴇ ʙᴏᴛ
            error: "( ⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀) *𝔼ℝℝ𝕆ℝ* ( ⚈̥̥̥̥̥́⌢⚈̥̥̥̥̥̀)\n\n• ꜰɪᴛᴜʀ ᴛᴇʀᴊᴀᴅɪ ᴋᴇꜱᴀʟᴀʜᴀɴ, ꜱɪʟᴀʜᴋᴀɴ ʟᴀᴘᴏʀᴋᴀɴ ᴏᴡɴᴇʀ!\n\n> ᴄʜᴀᴛ ᴏᴡɴᴇʀ: https://wa.me/62895375950107\n> _Atau ulangi perintah beberapa saat lagi!!_"
        },
        Exif: { // For sticker
            packId: "https://berkahesport.my.id/",
            packName: `ʙᴇʀᴋᴀʜᴇꜱᴘᴏʀᴛ.ɪᴅ\nChatBOT: 6289649672623`,
            packPublish: "Thank's to:\nAllah S.W.T",
            packEmail: "berkahesport@gmail.com",
            packWebsite: "https://berkahesport.my.id/",
            androidApp: "https://play.google.com/store/apps/details?id=com.bitsmedia.android.muslimpro",
            iOSApp: "https://apps.apple.com/id/app/muslim-pro-al-quran-adzan/id388389451?|=id",
            emojis: [],
            isAvatar: 0,
        }
}
